OdDAI.Attribute.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns Returns the current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.Attribute.originalName
\details
Retrieves the current attribute's original name.
\returns Returns an ANSI string that contains the attribute's original name.

OdDAI.Attribute.name
\details
Retrieves the current attribute's name.
\returns Returns an ANSI string that contains the attribute's name.

OdDAI.Attribute.#ctor(OdAnsiString,OdDAI.Entity*)
\details
Creates a new attribute object with specified parameters.
\param name     [in] A pointer to a string that contains the attribute name.
\param optional [in] A flag that determines whether the value of the created attribute is optional (equal to true) or mandatory (equal to false).